app/Http/Controllers/Voyager/Dimmers/MarketDimmer.php

    public function run()
    {
        $count = Market::count();
---
select count(*) as aggregate from `market`