app/Http/Controllers/Voyager/Dimmers/NewsDimmer.php

    public function run()
    {
        $count = News::count();
---
select count(*) as aggregate from `news`