app/Http/Controllers/NewsController.php

select * from `image_text` where `page_id` = 9 limit 1
select * from `news` where `status` = 1 order by `sort_id` desc limit 9 offset 0
select count(*) as aggregate from `news` where `status` = 1
select * from `pages` where (`type` = 'news') limit 1
---
    public function index()
    {
        $locale = session()->get('locale');
        $fallbackLocale = config('voyager.multilingual.default');

        $title = ImageText::with(['translations'])
        ->where('page_id', 9)
        ->firstOrFail();
        $title = $title->translate($locale, $fallbackLocale);

        $news = News::with(['translations'])
        ->where('status',true)
        ->orderBy('sort_id', 'desc')
        ->paginate($this->paginate)
        ->translate($locale, $fallbackLocale);

        $news_paginate = News::where('status',true)->orderBy('sort_id', 'desc')->paginate($this->paginate);

        $page = Page::with(['translations'])->where(['type' => 'news'])->firstOrFail();