app/Http/Controllers/PagesController.php

select `type`, `id`, `title`, `excerpt`, `body`, `image`, `slug`, `seo_title`, `meta_description`, `meta_keywords`, `status` from `pages` where (`slug` = 'analytics' and `status` = 'ACTIVE') limit 1
select * from `pages` where `type` not in ('home') and `status` = 'ACTIVE'
select * from `contact` where `type` = 'social' and `is_main` = 1 and `status` = 1 and `id` != 5 order by `sort_id` asc
select * from `news` where `status` = 1 order by `sort_id` desc limit 5
select * from `project` where `status` = 1 order by `sort_id` desc
select * from `main` limit 1
---
    public function getPage($slug = 'home')
    {
        $locale = session()->get('locale');
        $fallbackLocale = config('voyager.multilingual.default');
        if (strpos(url()->current(), 'home') !== false) {
            abort(404);
        } else {
            $page = Page::select('type', 'id', 'title', 'excerpt', 'body', 'image', 'slug', 'seo_title', 'meta_description', 'meta_keywords', 'status')
                ->where(['slug' => $slug, 'status' => Page::STATUS_ACTIVE])
                ->firstOrFail();
        }
        $page = $page->translate($locale, $fallbackLocale);

        $pages = Page::withTranslation($locale)->whereNotIn('type',['home'])->where('status',Page::STATUS_ACTIVE)->get();
        $pages = $pages->translate($locale,$fallbackLocale);
        $pages = $pages->groupBy('type');

        $socials = Contact::where('type','social')
                    ->where('is_main',true)
                    ->where('status',true)
                    ->where('id', '!=', 5)
                    ->orderBy('sort_id')
                    ->get();

        switch ($page->type) {
            case 'home':
                $news = News::with(['translations'])
                    ->where('status',true)
                    ->orderBy('sort_id', 'desc')
                    ->take(5)
                    ->get()
                    ->translate($locale, $fallbackLocale);

                $projects = Project::with(['translations'])
                    ->where('status', true)
                    ->orderBy('sort_id', 'asc')
                    ->get()
                    ->translate($locale, $fallbackLocale);

                $main = Main::with(['translations'])->firstOrFail()->translate($locale, $fallbackLocale);

select * from `partner` order by `id` asc
---
                return view('pages.' . $page->type, compact('page', 'pages', 'news', 'projects', 'main'));
                break;
            case 'members':
                $partners = Partner::with(['translations'])
                    ->orderBy('id', 'asc')
                    ->get()
                    ->translate($locale,$fallbackLocale);

select * from `about` limit 1
select * from `rule` limit 1
---
                return view('pages.' . $page->type, compact('page', 'pages', 'partners', 'socials'));
                break;
            case 'about':
                $about = About::with(['translations'])->firstOrFail()->translate($locale,$fallbackLocale);
                return view('pages.' . $page->type, compact('page', 'pages', 'about', 'socials'));
                break;
            case 'charter':
                $charter = Rule::with(['translations'])->firstOrFail()->translate($locale,$fallbackLocale);

select * from `image_text` where `page_id` = 15 limit 1
select * from `market` where `status` = 1 order by `sort_id` desc
select * from `member`
select * from `work`
---
                return view('pages.' . $page->type, compact('page', 'pages', 'policy', 'socials'));
                break;
            case 'partners':
                $title = ImageText::with(['translations'])
                    ->where('page_id', 15)
                    ->firstOrFail();
                    $title = $title->translate($locale, $fallbackLocale);

                $markets = Market::with(['translations'])
                    ->where('status',true)
                    ->orderBy('sort_id', 'desc')
                    ->get()
                    ->translate($locale, $fallbackLocale);

                $partners = Member::with(['translations'])->get()->translate($locale, $fallbackLocale);
                return view('pages.' . $page->type, compact('page', 'pages', 'socials', 'markets', 'partners', 'title'));
                break;
            case 'work':
                $markets = Market::with(['translations'])
                    ->where('status',true)
                    ->orderBy('sort_id', 'desc')
                    ->get()
                    ->translate($locale, $fallbackLocale);

                $works = Work::with(['translations'])->get()->translate($locale, $fallbackLocale);

select * from `image_text` where `page_id` = 17 limit 1
select * from `market` where `status` = 1 order by `sort_id` desc
select * from `platform` limit 1
select * from `news` where `status` = 1 order by `sort_id` desc limit 3
---
                return view('pages.' . $page->type, compact('page', 'pages', 'socials', 'markets', 'works'));
                break;
            case 'reviews':
                $title = ImageText::with(['translations'])
                    ->where('page_id', 17)
                    ->firstOrFail();
                    $title = $title->translate($locale, $fallbackLocale);

                $markets = Market::with(['translations'])
                    ->where('status',true)
                    ->orderBy('sort_id', 'desc')
                    ->get()
                    ->translate($locale, $fallbackLocale);
                return view('pages.' . $page->type, compact('page', 'pages', 'socials', 'title', 'markets'));
                break;
            case 'platform':
                $platform = Platform::with(['translations'])->firstOrFail();
                $platform = $platform->translate($locale, $fallbackLocale);

                $news = News::with(['translations'])
                    ->where('status', true)
                    ->orderBy('sort_id', 'desc')
                    ->take(3)
                    ->get()
                    ->translate($locale, $fallbackLocale);

select * from `analytic` limit 1
select * from `news` where `analytic` = 1 and `status` = 1 order by `sort_id` desc limit 3
select * from `market` where `status` = 1 order by `sort_id` desc
---
                return view('pages.' . $page->type, compact('page', 'pages', 'platform', 'news'));
                break;
            case 'analytics':
                $analytic = Analytic::with(['translations'])
                    ->firstOrFail()
                    ->translate($locale,$fallbackLocale);

                $news = News::with(['translations'])
                    ->where('analytic', true)
                    ->where('status', true)
                    ->orderBy('sort_id', 'desc')
                    ->take(3)
                    ->get()
                    ->translate($locale, $fallbackLocale);

                $markets = Market::with(['translations'])
                    ->where('status',true)
                    ->orderBy('sort_id', 'desc')
                    ->get()
                    ->translate($locale, $fallbackLocale);