app/Http/Controllers/ProjectController.php

    public function index()
    {
        $locale = session()->get('locale');
        $fallbackLocale = config('voyager.multilingual.default');

        $project = Project::with(['translations'])->where('status', true)->firstOrFail();
        $project = $project->translate($locale, $fallbackLocale);

        $id = $project->id;
        $projects = Project::with(['translations'])
            ->where('status', true)
            ->where('id', '!=', $id)
            ->get()
            ->translate($locale, $fallbackLocale);

        $socials = Contact::where('type','social')
                    ->where('is_main',true)
                    ->where('status',true)
                    ->where('id', '!=', 5)
                    ->orderBy('sort_id')
                    ->get();

        $pages = Page::withTranslation($locale)->whereNotIn('type',['home'])->where('status',Page::STATUS_ACTIVE)->get();
        $pages = $pages->translate($locale,$fallbackLocale);
        $pages = $pages->groupBy('type');

        $page = Page::with(['translations'])->where(['type' => 'projects'])->firstOrFail();
---
select * from `project` where `status` = 1 limit 1
select * from `project` where `status` = 1 and `id` != 1
select * from `contact` where `type` = 'social' and `is_main` = 1 and `status` = 1 and `id` != 5 order by `sort_id` asc
select * from `pages` where `type` not in ('home') and `status` = 'ACTIVE'
select * from `pages` where (`type` = 'projects') limit 1

    public function show($project)
    {
        $locale = session()->get('locale');
        $fallbackLocale = config('voyager.multilingual.default');

        $project = Project::with(['translations'])
            ->where('slug', $project)
            ->where('status', true)
            ->first()
            ->translate($locale, $fallbackLocale);
        $id = $project->id;

        $projects = Project::with(['translations'])
            ->where('status', true)
            ->where('id', '!=', $id)
            ->get()
            ->translate($locale, $fallbackLocale);

        $socials = Contact::where('type','social')
                    ->where('is_main',true)
                    ->where('status',true)
                    ->where('id', '!=', 5)
                    ->orderBy('sort_id')
                    ->get();

        $pages = Page::withTranslation($locale)->whereNotIn('type',['home'])->where('status',Page::STATUS_ACTIVE)->get();
        $pages = $pages->translate($locale,$fallbackLocale);
        $pages = $pages->groupBy('type');

        $page = Page::with(['translations'])->where(['type' => 'projects'])->firstOrFail();
---
select * from `project` where `slug` = 'smartphone-manufacturing' and `status` = 1 limit 1
select * from `project` where `status` = 1 and `id` != 3
select * from `contact` where `type` = 'social' and `is_main` = 1 and `status` = 1 and `id` != 5 order by `sort_id` asc
select * from `pages` where `type` not in ('home') and `status` = 'ACTIVE'
select * from `pages` where (`type` = 'projects') limit 1