app/Http/Controllers/TrendController.php

    public function index()
    {
        $locale = session()->get('locale');
        $fallbackLocale = config('voyager.multilingual.default');

        $socials = Contact::where('type','social')
                    ->where('is_main',true)
                    ->where('status',true)
                    ->where('id', '!=', 5)
                    ->orderBy('sort_id')
                    ->get();

        $trends = Trend::with(['translations'])
                    ->where('sort_id', '!=', 1)
                    ->where('status',true)
                    ->orderBy('sort_id', 'asc')
                    ->get()
                    ->translate($locale, $fallbackLocale);

        $trend = Trend::with(['translations'])->firstOrFail()->translate($locale, $fallbackLocale);

        $pages = Page::withTranslation($locale)->whereNotIn('type',['home'])->where('status',Page::STATUS_ACTIVE)->get();
        $pages = $pages->translate($locale,$fallbackLocale);
        $pages = $pages->groupBy('type');

        $page = Page::with(['translations'])->where(['type' => 'trends'])->firstOrFail();
---
select * from `contact` where `type` = 'social' and `is_main` = 1 and `status` = 1 and `id` != 5 order by `sort_id` asc
select * from `trend` where `sort_id` != 1 and `status` = 1 order by `sort_id` asc
select * from `trend` limit 1
select * from `pages` where `type` not in ('home') and `status` = 'ACTIVE'
select * from `pages` where (`type` = 'trends') limit 1

    public function show($trend)
    {
        $locale = session()->get('locale');
        $fallbackLocale = config('voyager.multilingual.default');

        $socials = Contact::where('type','social')
                    ->where('is_main',true)
                    ->where('status',true)
                    ->where('id', '!=', 5)
                    ->orderBy('sort_id')
                    ->get();

        $trends = Trend::with(['translations'])
                    ->where('slug', '!=', $trend)
                    ->where('status',true)
                    ->orderBy('sort_id', 'asc')
                    ->get()
                    ->translate($locale, $fallbackLocale);

        $trend = Trend::with(['translations'])->where('slug', $trend)->firstOrFail()->translate($locale, $fallbackLocale);

        $pages = Page::withTranslation($locale)->whereNotIn('type',['home'])->where('status',Page::STATUS_ACTIVE)->get();
        $pages = $pages->translate($locale,$fallbackLocale);
        $pages = $pages->groupBy('type');

        $page = Page::with(['translations'])->where(['type' => 'trends'])->firstOrFail();
---
select * from `contact` where `type` = 'social' and `is_main` = 1 and `status` = 1 and `id` != 5 order by `sort_id` asc
select * from `trend` where `slug` != 'ikt-na-sluzhbe-bezopasnosti' and `status` = 1 order by `sort_id` asc
select * from `trend` where `slug` = 'ikt-na-sluzhbe-bezopasnosti' limit 1
select * from `pages` where `type` not in ('home') and `status` = 'ACTIVE'
select * from `pages` where (`type` = 'trends') limit 1