app/Providers/AppServiceProvider.php

select `value`, `link` from `contact` where `type` = 'phone' and `is_main` = 1 and `status` = 1 limit 1
select `value` from `contact` where `type` = 'email' and `is_main` = 1 and `status` = 1 limit 1
select * from `contact` where `type` = 'social' and `is_main` = 1 and `status` = 1 order by `sort_id` asc
select * from `pages` where `type` not in ('home') and `status` = 'ACTIVE'
---
    public function boot()
    {
        Schema::defaultStringLength(191);
        Paginator::useBootstrap();

        view()->composer('*', function ($view) {
            $view->with('locale', session()->get('locale'));
            $view->with('fallbackLocale', config('voyager.multilingual.default'));
        });

        view()->composer(['partials.header', 'partials.footer'], function ($view)
        {
            $locale = session()->get('locale');
            $fallbackLocale = config('voyager.multilingual.default');

            $phone = Contact::select('value', 'link')->where('type','phone')->where('is_main',true)->where('status',true)->firstOrFail();
            $view->with('phone',$phone);

            $email = Contact::select('value')->where('type','email')->where('is_main',true)->where('status',true)->firstOrFail();
            $view->with('email',$email);

            $socials = Contact::where('type','social')->where('is_main',true)->where('status',true)->orderBy('sort_id')->get();
            $view->with('socials',$socials);

            $pages = Page::withTranslation($locale)->whereNotIn('type',['home'])->where('status',Page::STATUS_ACTIVE)->get();